app/views/listings/show.html.erb

	<% if @listing.sold %>
		<%= "Listing sold to: " + User.find(@listing.buyer_id).name %>
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]