app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = ?  [["user_id", 1]]
---
  def listing_index
  	@listing = current_user.listings.all

SELECT "listings".* FROM "listings"
---
  def master_listing
  	@listing = Listing.all

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "listings" SET "sold" = ?, "buyer_id" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["sold", "t"], ["buyer_id", 1], ["updated_at", "2016-05-10 00:39:05.345651"], ["id", 2]]
UPDATE "users" SET "balance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["balance", 77], ["updated_at", "2016-05-10 00:39:05.367277"], ["id", 1]]
---
  def buy
    @listing = Listing.find(params[:id])
    @user = User.find(@listing.user_id)
    if(current_user.balance < @listing.price)
      flash[:notice] = "NOT ENUFF MOOLAH"
      redirect_to show_listing_path(:id => @listing.id)
    else
      @current = User.find(current_user.id)
      @current.balance = @current.balance - @listing.price
      @user.balance = @user.balance + @listing.price
      @listing.sold = true
      @listing.buyer_id = current_user.id
      @listing.save

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @listing = Listing.find(params[:id])
    @user = User.find(@listing.user_id)

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @listing = Listing.find(params[:id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "listings" SET "description" = ?, "city" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["description", "Long ass boring descriptoin blah laskjdflaksjdfA:HAHAHAHAHAHAH I SEAID"], ["city", ":LKSDJF:LKSDJF:LKSJD:FLKJSDF"], ["updated_at", "2016-05-05 07:16:06.545658"], ["id", 2]]
---
  def update
  	@listing = Listing.find(params[:id])
  	@listing.update(listing_params)

INSERT INTO "listings" ("description", "price", "address", "city", "state", "zipcode", "start_date", "end_date", "user_id", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @listing = current_user.listings.new(listing_params)
    address = @listing.address + " " + @listing.city + ", " + @listing.state + " " + @listing.zipcode
    location = Geocoder.coordinates(address)
    @listing.latitude = location[0]
    @listing.longitude = location[1]
    @listing.save

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 3]]
---
  def destroy
    @listing = Listing.find(params[:id])
    @listing.destroy