app/controllers/profile_controller.rb

  def profile
    @current_user ||= User.find(session[:user_id]) if session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  def edit
	@current_user ||= User.find(session[:user_id]) if session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  def update
	@current_user ||= User.find(session[:user_id]) if session[:user_id]
	@current_user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "phone_number" = ?, "description" = ?, "home_town" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "tang.changrey@gmail.com"], ["phone_number", "5102831574"], ["description", "No"], ["home_town", "Fremont"], ["updated_at", "2016-04-30 04:19:35.210761"], ["id", 1]]

  def view_profile
    @listing = Listing.find(params[:id])
    @user = User.find(@listing.user_id)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]